Repository: samycesi/easysave
Catalog: View/Messages.*.resx
Languages: fr

# AddBackupJob
source: Create a backup job
fr: Créer un travail de sauvegarde

# BackupJobAddedSuccess
source: Backup job added successfully.
fr: Le travail de sauvegarde a été crée avec succès.

source: Change Language
fr: Changer de langue

# dailyPath
source: Please enter the path for the daily backup :
fr: Entrez le chemin du fichier pour stocker le fichier de log journalier :

# EnterBackupJobName
source: Enter a name for your backup job :
fr: Entrez le nom du travail de sauvegarde :

source: Enter Source Directory Path :
fr: Entrez le chemin du répertoire source :

source: Enter Target Directory Path :
fr: Entrez le chemin du répertoire cible :

source: Execute all backup jobs
fr: Exécuter tous les travaux de sauvegarde

# ExecuteBackupJob
source: Execute a backup job
fr: Exécuter un travail de sauvegarde

source: Exit
fr: Quitter

# Index
source: Enter the index of the Backup Job to execute (for example 1-3 execute Backup Job 1, 2 and 3) :
fr: Entrez l'index du travail de sauvegarde à executer (par exemple, 1-3 va executer les travaux 1, 2 et 3) :

# InvalidIndex
source: Invalid index, please enter a valid number.
fr: Index non valide.

# InvalidPath
source: Invalid path. Please enter a valid directory path :
fr: Chemin non valide. Veuillez entrer un chemin de répertoire valide.

# InvalidRange
source: Invalid range in segment.
fr: Entrée non valide dans le segment.

source: Invalid input.
fr: Votre saisie n'est pas valide

# ListBackup
source: ------ List of backup jobs ------
fr: Liste de travaux de sauvegarde

# ListBackupJobs
source: List existing Backup Jobs
fr: Lister les travaux de sauvegarde existants

# MaximumNumber
source: Error: Maximum number of backup jobs reached (5).
fr: Erreur : Le nombre maximum de travaux de sauvegarde a été atteint (5).

# MenuAddBackupJob
source: Backup Job Creation Menu
fr: Menu de création de travail de sauvegarde

# PleaseEnterValidRange
source: Please enter a valid range.
fr: Veuillez saisir un nombre ou une plage.

# SelectBackupType
source: Select Backup Type (1 for Full, 2 for Differential) :
fr: Sélectionnez le type de sauvegarde (1 pour Complète, 2 pour Différentielle) :

# SelectOption
source: Please select an option
fr: Selectionnez une option

# statePath
source: Please enter the path for the state backup :
fr: Entrez le fichier pour stocker le fichier de log en temps réel :

# Welcome
source: Welcome to EasySave 1.0
fr: Bienvenue dans EasySave 1.0

# EnterDeleteBackup
source: Enter the index of the Backup Task to delete (enter 0 to cancel) :
fr: Entrez l'index du travail de sauvegarde à supprimer (entrez 0 pour annuler) :

# DeleteBackup
source: Delete a backup job
fr: Supprimer un travail de sauvegarde

# EnterLogFileType
source: Please choose the type of the log file :
fr: Veuillez choisir le type du fichier log :

# NonExistentBackup
source: No backup task corresponds to this index.
fr: Aucun travail de sauvegarde ne correspond à cet index.
